Revit 2027 API
Sketch.GetAllElements Method
 Returns all elements which belong to the sketch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> GetAllElements()
Public Function GetAllElements As IList(Of ElementId)
public:
IList<ElementId^>^ GetAllElements()
member GetAllElements : unit -> IList<ElementId>
Return Value
IList<ElementId>
 Returns ids of elements which belong to that sketch.
Remarks
 Following elements can belong to a sketch: ModelCurve, ReferencePlane, Dimension. To get matching between Curve from Profile and ModelCurve, use [!:Autodesk::Revit::DB::Curve::Reference::ElementId].
See Also
Reference
Sketch Class
Autodesk.Revit.DB Namespace